// Задание1
 let arr = [1, 2, 3, 4, 5];
 for (let i = 0; i< arr.length; i++){
document.write(arr[i]);
 }
// Задание2
 let arr2 = [ -2, -1, -3, 15, 0, -4, 2, -5, 9, -15, 0, 4, 5, -6, 10, 7];
 for (i = 0; i > -10 && i < -3;i++ );{
    document.write(arr2[i])
 }
//  Задание3
let arr3 = [23, 24 , 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57];
let result = 0;
for ( let i = 0;  i <= 57; i++){
    console.log(arr3[i])
}